# Прогнозирование заказов такси

## Описание задачи  

Нужно спрогнозировать количество заказов такси на следующий час, чтобы привлекать больше водителей в период пиковой нагрузки
Метрика - RMSE. Целевое значение < 48.

## Данные

 - `num_orders` - число заказов
 - `datetime` - дата и время

## Выводы

В качестве моделей машинного обучения были взяты RandomForest, Catboost, LightGBM

Получили следующие данные по моделям:

| model       | RMSE                
| ------------- |:------------------:|
| LinearRegression     | 43.491403    
| RandomForestRegressor     | 42.821147
| LightGBM  | 43.272450 
| Catboost  | 43.008657     

Хотя и добились того, что мерика RMSE не превышает 48, но есть еще возможность для ее улучшения, т.к по графику временного ряда видны значительные расхождения

## Что еще необходимо сделать

1. Сравнить значение метрики с константной моделью
2. Попробовать найти более оптимальные гиперпараметры для моделей (в частности LightGBM и RandomForest)
3. Попробовать другие модели для временных рядов, например, SARIMA, ARIMA
